samples/ITI-44_response_raw.xml

<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope" xmlns:hl7="urn:hl7-org:v3" xmlns:wsa="http://www.w3.org/2005/08/addressing">
 <Header>
  <wsa:MessageID>urn:uuid:03a231cc-c38e-400f-99eb-9434bc7008ff</wsa:MessageID>
  <wsa:RelatesTo RelationshipType="http://www.w3.org/2005/08/addressing/reply">urn:uuid:7a180388-6ba7-4cbc-bffe-dfcdc4e602b7</wsa:RelatesTo>
  <wsa:Action>urn:hl7-org:v3:MCCI_IN000002UV01</wsa:Action>
 </Header>
 <Body>
  <hl7:MCCI_IN000002UV01 ITSVersion="XML_1.0">
   <hl7:id extension="e4917ebf-6a17-48b3-85ef-100c756a0ac1" root="1.1"/>
   <hl7:creationTime value="202092393350"/>
   <hl7:interactionId extension="MCCI_IN000002UV01" root="2.16.840.1.113883.1.6"/>
   <hl7:processingCode code="T"/>
   <hl7:processingModeCode code="T"/>
   <hl7:acceptAckCode code="NE"/>
   <hl7:receiver typeCode="RCV">
    <hl7:device classCode="DEV" determinerCode="INSTANCE">
     <hl7:id root="1.3.6.1.4.1.21367.2017.2.2.100"/>
    </hl7:device>
   </hl7:receiver>
   <hl7:sender typeCode="SND">
    <hl7:device classCode="DEV" determinerCode="INSTANCE">
     <hl7:id root="1.3.6.1.4.1.21367.2017.2.4.98"/>
    </hl7:device>
   </hl7:sender>
   <hl7:acknowledgement>
    <hl7:typeCode code="CA"/>
    <hl7:targetMessage>
     <hl7:id root="647aee99-56e7-46f5-ac26-bb691834204a"/>
    </hl7:targetMessage>
    <hl7:acknowledgementDetail/>
   </hl7:acknowledgement>
  </hl7:MCCI_IN000002UV01>
 </Body>
</Envelope>
