ESBComponents/MessageValidator/src/test/resources/testdata/pd/PD_Valid_RequestMsg.xml

<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">https://D7Z0S3Q1.aegis.net:9897/CONNECTGateway/NhinService/NhinPatientDiscovery</To><Action xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201305UV02:CrossGatewayPatientDiscovery</Action><ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
</ReplyTo><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:e2a8d2d7-1ece-4930-9b4f-3868f5a4022e</MessageID><wsse:Security S:mustUnderstand="true"><wsu:Timestamp xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns16="http://schemas.xmlsoap.org/soap/envelope/" wsu:Id="_1"><wsu:Created>2012-03-27T18:19:08Z</wsu:Created><wsu:Expires>2012-03-27T18:24:08Z</wsu:Expires></wsu:Timestamp><saml2:Assertion xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xs="http://www.w3.org/2001/XMLSchema" ID="f4d523cc-2d60-44ed-8d80-ac8b1a95d904" IssueInstant="2012-03-27T18:19:08.500Z" Version="2.0"><saml2:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=SAML User,OU=SU,O=SAML User,L=Los Angeles,ST=CA,C=US</saml2:Issuer><saml2:Subject><saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">UID=Scenario 1 PDI-1.1c</saml2:NameID><saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key"><saml2:SubjectConfirmationData><ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue><ds:Modulus>ksJ/LW4SmSA8Qb6l8YkgEGlZ/US2TFeDHrS8MXEkXfMdK0ou8tRog80C4mpxFfPQygofjPs3ahgb/Rj+lSE1hSeaRuqIm1tcvOq/xvqjU1s0fzzvBJN/3kYMJUkbZSkhNAHekGIms9n/zUUjsRKpdLoH+d96ymsfyvXVBAmHOlerJrjBSWdugoAX/ypVCc9aadJJuMNZdoiylbWL+DAr0Vi1LFcWXUJqgCR6KuZAkfTHej7eg8sNa87yPSeYndg1S1sCfh4QYaBgBOevtYtFv5nnqMujilB831bIZJ1Goo5Dw1JXYEYfuwsIKLAI855ZGHb5eBopjiTHoaAn/CJcHQ==</ds:Modulus><ds:Exponent>AQAB</ds:Exponent></ds:RSAKeyValue>
</ds:KeyValue>
</ds:KeyInfo></saml2:SubjectConfirmationData></saml2:SubjectConfirmation></saml2:Subject><saml2:AuthnStatement AuthnInstant="2012-03-27T18:19:07.895Z" SessionIndex="123456"><saml2:SubjectLocality /><saml2:AuthnContext><saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509</saml2:AuthnContextClassRef></saml2:AuthnContext></saml2:AuthnStatement><saml2:AttributeStatement><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id"><saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">Lab IT Testcase</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization"><saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">2.16.840.1.113883.0.213</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id"><saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">2.16.840.1.113883.0.213</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:nhin:names:saml:homeCommunityId"><saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">2.16.840.1.113883.0.213</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role"><saml2:AttributeValue><hl7:Role xmlns:hl7="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="46255001" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED_CT" displayName="Pharmacist" xsi:type="hl7:CE" /></saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse"><saml2:AttributeValue><hl7:PurposeForUse xmlns:hl7="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="TREATMENT" codeSystem="2.16.840.1.113883.3.18.7.1" codeSystemName="nhin-purpose" displayName="Treatment" xsi:type="hl7:CE" /></saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id"><saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">KET21300037^^^&amp;2.16.840.1.113883.0.213&amp;ISO</saml2:AttributeValue></saml2:Attribute></saml2:AttributeStatement><saml2:AuthzDecisionStatement Decision="Permit" Resource="https://D7Z0S3Q1.aegis.net:9897/CONNECTGateway/NhinService/NhinPatientDiscovery"><saml2:Action Namespace="urn:oasis:names:tc:SAML:1.0:action:rwedc">Execute</saml2:Action><saml2:Evidence><saml2:Assertion ID="709df00c-1be2-447f-88c3-e9d8ac458343" IssueInstant="2012-03-27T18:19:07.902Z" Version="2.0"><saml2:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=SAML User,OU=SU,O=SAML User,L=Los Angeles,ST=CA,C=US</saml2:Issuer><saml2:Conditions NotBefore="2012-03-27T18:19:07.902Z" NotOnOrAfter="2012-03-27T18:19:07.902Z" /><saml2:AttributeStatement><saml2:Attribute Name="AccessConsentPolicy" NameFormat="http://www.hhs.gov/healthit/nhin" /><saml2:Attribute Name="InstanceAccessConsentPolicy" NameFormat="http://www.hhs.gov/healthit/nhin" /></saml2:AttributeStatement></saml2:Assertion></saml2:Evidence></saml2:AuthzDecisionStatement><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" /><ds:Reference URI="#f4d523cc-2d60-44ed-8d80-ac8b1a95d904"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" /><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><ds:DigestValue>xQRBYD9jIYKKphGOTbv+u9lhT5w=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>kiFEtKkWwZGhbf2XczC+kJsrc+fbt8OARm7Xx4JpxT/xJd4SkSCnhbNgoMXsCDdOCQ4FphDdIOov
/MDKyI6WdjTL4w+wW/s7yA5IuN/H3gN5Wn9YXdFt41nMZHjePWoWaLtBsJ80+gk++NFTwN7O4Dib
+eLGBtoappWBtXlnCfeoKaRHBGXhIQwV5y8yXWbqAm++012iE4AgtEDhH3gs/RfrMQOhSHTARt0P
oW+A4vSqfd/1Kb0yhfzoxYP+D3Fc+SVoazqupjG3icHLVq6fcTnLnzZZkUOYA3933HxPVzoWvpWS
eYGmY5KbFdSIVJuSMB7LHkrJLnAA7U8uW5UVMg==</ds:SignatureValue><ds:KeyInfo><ds:KeyValue><ds:RSAKeyValue><ds:Modulus>ksJ/LW4SmSA8Qb6l8YkgEGlZ/US2TFeDHrS8MXEkXfMdK0ou8tRog80C4mpxFfPQygofjPs3ahgb
/Rj+lSE1hSeaRuqIm1tcvOq/xvqjU1s0fzzvBJN/3kYMJUkbZSkhNAHekGIms9n/zUUjsRKpdLoH
+d96ymsfyvXVBAmHOlerJrjBSWdugoAX/ypVCc9aadJJuMNZdoiylbWL+DAr0Vi1LFcWXUJqgCR6
KuZAkfTHej7eg8sNa87yPSeYndg1S1sCfh4QYaBgBOevtYtFv5nnqMujilB831bIZJ1Goo5Dw1JX
YEYfuwsIKLAI855ZGHb5eBopjiTHoaAn/CJcHQ==</ds:Modulus><ds:Exponent>AQAB</ds:Exponent></ds:RSAKeyValue></ds:KeyValue></ds:KeyInfo></ds:Signature></saml2:Assertion><ds:Signature xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns16="http://schemas.xmlsoap.org/soap/envelope/" Id="_2"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><exc14n:InclusiveNamespaces PrefixList="wsse S" /></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" /><ds:Reference URI="#_1"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><exc14n:InclusiveNamespaces PrefixList="wsu wsse S" /></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><ds:DigestValue>SuM7CiWczEMqjBdW0spdBTEA9V8=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>ckoZQgg/iPU0xZUUf7TLHBF+MGNm633eEgjI6kHk10pv4/+RwSrFICPkAyd49Rpg5L1wHMVcYACPGi/WffNM9I6S0J8sM9tgHAevZCTBSyKYx2WW74GIM8ftatGxeUHyA2KcwVeWXGwQmjfvY4J2bl7zJNCOuJx62DjzOin17g3rVPv/7114H4RGUmMcU9DIUuR5fQlscLcqcXzGat7NWexfpSiw4seuVqz9NwLPx8RD5bkU2GiVUVHVU0BwRk300xAH0e/Bv4228ziSfN0ASzWrt/6OQCIHUiPFq1Wz+Ammzwhi8YV/V3SVatH23mZNbceC7yqMnfajSyDQoo1pKw==</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0"><wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">f4d523cc-2d60-44ed-8d80-ac8b1a95d904</wsse:KeyIdentifier></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></S:Header><S:Body><PRPA_IN201305UV02 xmlns="urn:hl7-org:v3" xmlns:ns2="urn:gov:hhs:fha:nhinc:common:nhinccommon" xmlns:ns3="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:ns4="urn:gov:hhs:fha:nhinc:common:patientcorrelationfacade" ITSVersion="XML_1.0"><id extension="-5a3e95b1:11d1fa33d45:-7f9b" root="2.16.840.1.113883.0.213"/><creationTime value="20120327141907"/><interactionId extension="PRPA_IN201305UV02" root="2.16.840.1.113883.1.6"/><processingCode code="T"/><processingModeCode code="T"/><acceptAckCode code="AL"/><receiver typeCode="RCV"><device determinerCode="INSTANCE" classCode=""><id root="1.2.345.678.999"/><asAgent classCode="AGNT"><representedOrganization determinerCode="INSTANCE" classCode="ORG"><id root="2.16.840.1.113883.0.101"/></representedOrganization></asAgent></device></receiver><sender typeCode="SND"><device determinerCode="INSTANCE" classCode="DEV"><id root="2.16.840.1.113883.0.213"/><asAgent classCode="AGENT"><representedOrganization determinerCode="INSTANCE" classCode="ORG"><id root="2.16.840.1.113883.0.213"/></representedOrganization></asAgent></device></sender><controlActProcess moodCode="EVN" classCode="CACT"><code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201305UV02"/><authorOrPerformer typeCode="AUT"><assignedDevice classCode=""><id root="2.16.840.1.113883.0.213"/></assignedDevice></authorOrPerformer><queryByParameter><queryId extension="-abd3453dcd24wkkks545" root="2.16.840.1.113883.0.213"/><statusCode code="new"/><responseModalityCode code="R"/><responsePriorityCode code="I"/><parameterList><livingSubjectAdministrativeGender><value code="F"/><semanticsText representation="TXT"/></livingSubjectAdministrativeGender><livingSubjectBirthTime><value value="19701001"/><semanticsText representation="TXT"/></livingSubjectBirthTime><livingSubjectId><value extension="KET21300037" root="2.16.840.1.113883.0.213"/><semanticsText representation="TXT"/></livingSubjectId><livingSubjectName><value><family partType="FAM">Marquez</family><given partType="GIV">Marta</given></value><semanticsText representation="TXT"/></livingSubjectName><patientAddress><value/></patientAddress></parameterList></queryByParameter></controlActProcess></PRPA_IN201305UV02></S:Body></S:Envelope>