packages/core/src/external/carequality/ihe-gateway-v2/__tests__/xmls/xcpd_error.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <soap:Header>
        <wsa:To soap:mustUnderstand="true">http://www.w3.org/2005/08/addressing/anonymous</wsa:To>
        <wsa:Action soap:mustUnderstand="true">urn:hl7-org:v3:PRPA_IN201306UV02:CrossGatewayPatientDiscovery</wsa:Action>
        <wsa:MessageID soap:mustUnderstand="true">urn:uuid:aeb7327a-8c0a-4623-a708-d8b0919602cf</wsa:MessageID>
        <wsa:RelatesTo soap:mustUnderstand="true">urn:uuid:383c4fce-576f-4741-a441-f2eac54dbfc8</wsa:RelatesTo>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="TS-8513bee7-c846-4cad-b6f7-2906d6abaf23">
                <wsu:Created>2024-04-07T23:58:50.905Z</wsu:Created>
                <wsu:Expires>2024-04-08T00:02:10.905Z</wsu:Expires>
            </wsu:Timestamp>
            <wsse11:SignatureConfirmation xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" Value="jJv/AfLaHWSgDaTlUlEXykPQ6mdlkbpp/PFGjzTCXseMUHQnglcI44OhRBoiZFOC7F1W7Nt/K+OqtOSWYkunhA3gLq91tNuZGPVaBioaE3mAAbGKgmfmbBaDtpqUvhMjZOJNcvVi6Rzrez0v5XAzKwNTi2u/k2QdDBDUwvGYDak2yYxdvHVh1essEGWVfCF4Sb12RVPhFXMq3qYauh9nKHJjMBkxvY+dEGx/SNKnOsih65fiAtgQ9MkqpNme4j/6wdNoc+hEeoATmOEejO2GBWjV0gNzBwP9ZdBv5BO3n7NFHVy6s/E6L9cEk2FbwZ6d5ZMoPOh1poRhvh6W3mnyAg==" wsu:Id="SC-c3135dfb-3228-471d-9f48-ae80e0e939e4"/>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <PRPA_IN201306UV02 xmlns="urn:hl7-org:v3" ITSVersion="XML_1.0">
            <id extension="b9eeb429-7428-43f3-a205-7f4d1f78a4f9" root="2.16.840.1.113883.3.9621"/>
            <creationTime value="20240408120030"/>
            <interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/>
            <processingCode code="P"/>
            <processingModeCode code="T"/>
            <acceptAckCode code="NE"/>
            <receiver typeCode="SND">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="1.2.840.114350.1.13.999.567"/>
                    <asAgent classCode="AGNT">
                        <representedOrganization classCode="ORG" determinerCode="INSTANCE">
                            <id root="2.16.840.1.113883.3.3126.2.4.40989.5"/>
                        </representedOrganization>
                    </asAgent>
                </device>
            </receiver>
            <sender typeCode="SND">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.840.1.113883.3.9621"/>
                </device>
            </sender>
            <acknowledgement>
                <typeCode code="AE"/>
                <targetMessage>
                    <id extension="018ebe9f-e337-712f-8349-7333696a481a" root="2.16.840.1.113883.3.9621"/>
                </targetMessage>
                <acknowledgementDetail typeCode="E">
                    <code code="INTERR" codeSystem="2.16.840.1.113883.5.1100"/>
                    <text>No binding for namespace prefix urn</text>
                </acknowledgementDetail>
            </acknowledgement>
            <controlActProcess classCode="CACT" moodCode="EVN">
                <code code="PRPA_TE201306UV02" codeSystem="2.16.840.1.113883.1.6"/>
                <reasonOf typeCode="RSON">
                    <detectedIssueEvent classCode="ALRT" moodCode="EVN">
                        <code code="ActAdministrativeDetectedIssueCode" codeSystem="2.16.840.1.113883.5.4"/>
                        <mitigatedBy typeCode="MITGT">
                            <detectedIssueManagement classCode="ACT" moodCode="EVN">
                                <code code="InternalError" codeSystem="1.3.6.1.4.1.19376.1.2.27.3"/>
                            </detectedIssueManagement>
                        </mitigatedBy>
                    </detectedIssueEvent>
                </reasonOf>
                <queryAck>
                    <queryId extension="018ebe9f-e337-712f-8349-7333696a481a" root="2.16.840.1.113883.3.9621"/>
                    <statusCode code="aborted"/>
                    <queryResponseCode code="AE"/>
                </queryAck>
                <queryByParameter>
                    <queryId extension="1234" root="2.16.840.1.113883.3.9621"/>
                    <statusCode code="new"/>
                    <parameterList>
                        <livingSubjectAdministrativeGender>
                            <value code="M" codeSystem="2.16.840.1.113883.5.1"/>
                            <semanticsText>LivingSubject.administrativeGender</semanticsText>
                        </livingSubjectAdministrativeGender>
                        <livingSubjectBirthTime>
                            <value value="19810101"/>
                            <semanticsText>LivingSubject.birthTime</semanticsText>
                        </livingSubjectBirthTime>
                        <livingSubjectId>
                            <value extension="666-10-0001" root="2.16.840.1.113883.4.1"/>
                            <semanticsText>LivingSubject.id</semanticsText>
                        </livingSubjectId>
                        <livingSubjectName>
                            <value>
                                <family>NWHINZZZTESTPATIENT</family>
                                <given>NWHINONE</given>
                            </value>
                            <semanticsText>LivingSubject.name</semanticsText>
                        </livingSubjectName>
                        <patientAddress>
                            <value>
                                <streetAddressLine>1100 Test Street</streetAddressLine>
                                <city>Helena</city>
                                <state>AL</state>
                                <postalCode>35080</postalCode>
                                <country>USA</country>
                            </value>
                            <semanticsText>Patient.addr</semanticsText>
                        </patientAddress>
                        <patientTelecom>
                            <value value="tel:205-111-1111"/>
                            <semanticsText>Patient.telecom</semanticsText>
                        </patientTelecom>
                        <principalCareProviderId>
                            <value extension="1234" root="2.16.840.1.113883.4.6"/>
                        </principalCareProviderId>
                        <principalCareProviderId>
                            <value extension="1234" root="2.16.840.1.113883.4.6"/>
                        </principalCareProviderId>
                    </parameterList>
                </queryByParameter>
            </controlActProcess>
        </PRPA_IN201306UV02>
    </soap:Body>
</soap:Envelope>
